tap "aws/tap"
tap "borkdude/brew"
tap "homebrew/bundle"
tap "homebrew/services"
# Shell plugin manager
brew "antibody"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Emacs dependency management
brew "cask"
# Cross-platform make
brew "cmake"
# Modern replacement for 'ls'
brew "exa"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Package manager for the Lua programming language
brew "luarocks"
# Node version management
brew "n"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Tracks most-used directories to make cd smarter
brew "z"
# GPU-accelerated terminal emulator
cask "alacritty"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "google-chrome"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
